Revit 2024 API
ProgressChangedEventArgs Class
 The event arguments used by the ProgressChanged event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class ProgressChangedEventArgs : RevitAPISingleEventArgs
Visual Basic
Public Class ProgressChangedEventArgs _
	Inherits RevitAPISingleEventArgs
Visual C++
public ref class ProgressChangedEventArgs : public RevitAPISingleEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.ProgressChangedEventArgs
See Also
ProgressChangedEventArgs Members
Autodesk.Revit.DB.Events Namespace